FV2510/E_0077.dot
digraph D {
    labelloc="t";
    label=<<B><FONT POINT-SIZE="18">MaBiS</FONT></B><BR align="left"/><BR/><B><FONT POINT-SIZE="16">7.64.3: AD: Übermittlung Datenstatus für die monatliche Ausfallarbeitsüberführungszeitreihe (AAÜZ) an NB und BKV(LF)</FONT></B><BR align="left"/><BR/><BR/><BR/>>;
    ratio="compress";
    concentrate=true;
    pack=true;
    rankdir=TB;
    packmode="array";
    size="20,20";
    fontsize=12;
    pad=0.25;
    "Start" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#8ba2d7", label=<<B>E_0077</B><BR align="left"/><FONT>Prüfende Rolle: <B>BIKO</B></FONT><BR align="center"/>>, fontname="Roboto, sans-serif"];
    "1" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>1: </B>Ist die eingegangene Prüfmitteilung positiv?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A**: Hinweis: A** wird durch richtigen Code aus dem System des BIKO ersetzt. Mögliche Codes sind:
A01	Datenstatus „Abrechnungsdaten“
A02	Datenstatus „Prüfdaten“
A03	Datenstatus „Abgerechnete Daten“
A04	Datenstatus „Abrechnungsdaten KBKA“" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A**</B><BR align="left"/><BR align="left"/><FONT>Hinweis: A** wird durch richtigen Code aus dem System des BIKO ersetzt. Mögliche Codes sind:<BR align="left"/>A01	Datenstatus „Abrechnungsdaten“<BR align="left"/>A02	Datenstatus „Prüfdaten“<BR align="left"/>A03	Datenstatus „Abgerechnete Daten“<BR align="left"/>A04	Datenstatus „Abrechnungsdaten KBKA“<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "2" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>2: </B>Liegt der Datenstatus „Prüfdaten“ vor?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A**: Hinweis: A** wird durch richtigen Code aus dem System des BIKO ersetzt. Mögliche Codes sind:
A01	Datenstatus „Abrechnungsdaten“
A03	Datenstatus „Abgerechnete Daten“
A04	Datenstatus „Abrechnungsdaten KBKA“" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A**</B><BR align="left"/><BR align="left"/><FONT>Hinweis: A** wird durch richtigen Code aus dem System des BIKO ersetzt. Mögliche Codes sind:<BR align="left"/>A01	Datenstatus „Abrechnungsdaten“<BR align="left"/>A03	Datenstatus „Abgerechnete Daten“<BR align="left"/>A04	Datenstatus „Abrechnungsdaten KBKA“<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "3" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>3: </B>Erfolgt der Eingang der Prüfmitteilung vor Ablauf der Frist für die<BR align="left"/>Clearingphase der BKA (ohne KBKA)?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A01" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A01</B><BR align="left"/><BR align="left"/><FONT>Datenstatus „Abrechnungsdaten“<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "A04" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A04</B><BR align="left"/><BR align="left"/><FONT>Datenstatus „Abrechnungsdaten KBKA“<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];

    "Start" -> "1" [color="#88a0d6"];
    "1" -> "A**: Hinweis: A** wird durch richtigen Code aus dem System des BIKO ersetzt. Mögliche Codes sind:
A01	Datenstatus „Abrechnungsdaten“
A02	Datenstatus „Prüfdaten“
A03	Datenstatus „Abgerechnete Daten“
A04	Datenstatus „Abrechnungsdaten KBKA“" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "1" -> "2" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "2" -> "A**: Hinweis: A** wird durch richtigen Code aus dem System des BIKO ersetzt. Mögliche Codes sind:
A01	Datenstatus „Abrechnungsdaten“
A03	Datenstatus „Abgerechnete Daten“
A04	Datenstatus „Abrechnungsdaten KBKA“" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "2" -> "3" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "3" -> "A01" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "3" -> "A04" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];

    bgcolor="transparent";
fontname="Roboto, sans-serif";
}
